tap "anomalyco/tap"
tap "unused-code/formulae"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# GNU File, Shell, and Text utilities
brew "coreutils"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Small tool to convert Djvu files to PDF files
brew "djvu2pdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Postgres C API library
brew "libpq"
# Library for command-line editing
brew "readline"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell command parallelization utility
brew "parallel"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Database of common MIME types
brew "shared-mime-info"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-iosevka-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Modern programming language in the Lisp/Scheme family
cask "racket"
# Configuration application for the Ultimate Hacking Keyboard
cask "uhk-agent"
# Collect, organise, cite, and share research sources
cask "zotero"
