tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "xz"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "bison"
brew "openssl@3"
brew "readline"
brew "chruby"
brew "coreutils"
brew "elixir"
brew "fzf"
brew "libavif"
brew "gdbm"
brew "gdk-pixbuf"
brew "netpbm"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "jq"
brew "libffi"
brew "libxml2"
brew "libyaml"
brew "neovim"
brew "node"
brew "nvm"
brew "openssl@1.1"
brew "postgresql@14", restart_service: :changed
brew "python@3.10"
brew "python@3.11"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruby-install"
brew "shared-mime-info"
brew "tmux"
brew "tree"
brew "watch"
brew "yt-dlp"
brew "heroku/brew/heroku"
cask "font-iosevka-nerd-font"
cask "font-sauce-code-pro-nerd-font"
